modified docs
